In [2]:
import pandas as pd
import sqlalchemy

In [22]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:root@localhost:3306/test')

In [23]:

df = pd.read_sql_table('customers',engine)
df

   name  age
0   chi   90
1   chi   90
2  chiw   90
3  chia   90
4  chio   90

In [24]:
df = pd.read_sql_table('customers',engine, columns=['age'])
df

   age
0   90
1   90
2   90
3   90
4   90

In [25]:
df = pd.read_sql_query("select name from customers",engine)
df

   name
0   chi
1   chi
2  chiw
3  chia
4  chio

In [26]:
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal               2
1  maria sharapova               4
2   vladimir putin              11
3      kim un jong              32
4       jeff bezos              23
5     rahul gandhi              11

In [27]:
df.rename(columns={
    'Customer Name':'name',
    'Customer Phone':'age'
}, inplace=True)
df

              name  age
0     rafael nadal    2
1  maria sharapova    4
2   vladimir putin   11
3      kim un jong   32
4       jeff bezos   23
5     rahul gandhi   11

In [28]:
df.to_sql(
    name='customers', # database table name
    con=engine,
    if_exists='append',
    index=False
)